templates/wave_tank/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5.0; // Longer run to allow wave to propagate

deltaT          0.01;

writeControl    timeStep;

writeInterval   50; // Write every 0.5s approx

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo           1.0;
maxAlphaCo      1.0;

maxDeltaT       1;

functions
{
    velocityProbe
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   1;
        fields          (U p_rgh alpha.water);
        probeLocations
        (
            (0 0 -5) // Probe at x=0, should see wave passing
        );
    }
}

// ************************************************************************* //
